x = 38

print("здравствуйте")
if x < 0:
    print("меньше нуля")
print("до свидания")

# примеры 1_
a, b = 10, 5

if a > b:
    print("a > b")

if a > b and a > 0:
    print("успех", "1_1")

if (a > b) and (a > 0 or b < 1000):
    print("успех", "1_2")

if 5 < b and b < 10:
    print("успех", "1_3")

# можно сравнивать - числа, строки, списки 2_

if '34' > '123':
    print("успех", "2_1")

if '123' > '12':
    print("успех", "2_2")

if [1, 2] > [1, 1]:
    print("успех", "2_3")

# что нельзя сравнивать - разные типы 3_

if '6' > 5:
    print("успех", "3_1")

if [5, 6] > 5:
   print("успех", "3_2")

# но
if '6' != 5:
    print("успех", "3_3")
